#include <stdio.h>
#include <string.h>

int main() {

    // 문자 ======================================================================================================================================================================
    char ch = 'A';

    printf("문자1: %c\n", ch);

    char ch2 = 65;

    printf("문자2: %c\n", ch2);  

    // ==========================================================================================================================================================================

    // 문자열 ======================================================================================================================================================================
    char str1[] = "ABC";

    printf("문자열1 : %s\n", str1);

    printf("문자열2 : ");

    for (int i = 0; str1[i] != '\0'; i++) {
        printf("%c ", str1[i]);
    }

    printf("\n");

    // 문자열 길이
    printf("문자열 길이 : %lu\n", strlen(str1));

    // 문자열 복사
    char src[] = "ABC";
    char dest[10];

    strcpy(dest, src);

    printf("복사된 문자열: %s\n", dest);

    // 문자열 합치기
    char str2[] = "ABC";
    char str3[] = "DEF";

    strcat(str2, str3);

    printf("합쳐진 문자열 : %s\n", str2);

    // 문자열에서 문자 인덱스 찾기
    char str4[] = "ABC";
    char *ptr = strchr(str4, 'B');

    if (ptr != NULL)
        // 찾는 문자의 주소값에서 문자의 시작 주소값을 빼서 인덱스를 구함
        printf("B는 %ld에 있음\n", ptr - str4);
    else
        printf("문자를 찾을 수 없음\n");

    // 문자열에서 문자 포함 여부
    char str5[] = "ABC";
    char *found = strstr(str5, "B");

    if (found != NULL)
        printf("B의 주소값 이후의 문자열 : %s\n", found);
    else
        printf("못 찾음\n");

    // ==========================================================================================================================================================================

    return 0;
}